Revit 2027 API
IDuctFittingAndAccessoryPressureDropUIServer.GetDBServerId Method
 Returns the Id of the corresponding DB server for which this server provides an optional UI.
Namespace: Autodesk.Revit.UI.Mechanical
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
Guid GetDBServerId()
Function GetDBServerId As Guid
Guid GetDBServerId()
abstract GetDBServerId : unit -> Guid
Return Value
Guid
 The Id of the DB server.
Remarks
 Note that there may be only one UI server assigned to a DB calculation server.
See Also
Reference
IDuctFittingAndAccessoryPressureDropUIServer Interface
Autodesk.Revit.UI.Mechanical Namespace